{
  "nav": {
    "about": "Sobre mí",
    "projects": "Proyectos",
    "education": "Formación",
    "skills": "Habilidades",
    "contact": "Contacto"
  },
  "about": {
    "title": "Sobre mí",
    "text": "¡Hola! Soy Carlos ‘Tuto’ Curiel Ramos. De formación soy psicólogo y psicoterapeuta humanista, con varios años de experiencia ayudando a personas a encontrar sentido, sanar sus heridas y reencontrarse consigo mismas. También soy músico, amante de los acordes suaves del indie rock, de los delays bien colocados y de los versos que dicen más de lo que aparentan.\n\nPero como diría cierto mago gris —que nunca llega tarde ni pronto, sino cuando se lo propone—, uno nunca termina de conocerse hasta que se atreve a explorar caminos nuevos. Y fue así como, espada en mano (bueno, teclado en mano), me lancé al mundo del desarrollo web.\n\nA través de un bootcamp intensivo, me he formado como desarrollador full stack, trabajando en proyectos que integran frontend (React, Tailwind, Framer Motion) y backend (Node.js, Express, SQL), APIs externas y despliegue en Vercel. He desarrollado una app de gestión de alquileres con login, historial de usuarios y mapas interactivos; una calculadora de huella de carbono personalizada; y un temporizador Pomodoro animado y responsive.\n\nMe apasiona escribir código con intención, con la misma sensibilidad con la que compondría una canción o acompañaría a alguien en terapia. La programación me permite aplicar lógica, diseño, empatía y visión de mejora continua.\n\nEstoy con muchas ganas de seguir aprendiendo, crecer como desarrollador y sumar valor allá donde pueda aportar. Si mi perfil resuena contigo —como un buen opening de anime—, estaré encantado de conectar."
  },
  "education": {
    "title": "Formación",
    "item1": {
      "degree": "Bootcamp Desarrollo Web Full Stack",
      "institution": "Hack a Boss"
    },
    "item2": {
      "degree": "Licenciatura en Psicología",
      "institution": "Universidad Santa Maria la Antigua (Panamá)"
    }
  },
  "skills": {
    "title": "Habilidades",
    "knownTitle": "Tecnologías que domino y uso:",
    "learningTitle": "Technologías que estoy aprendiendo:",
    "SoftSkillsTitle": "Habilidades blandas",
    "SoftSkillsList": [
      "Comunicación",
      "Trabajo en equipo",
      "Resolución de problemas",
      "Gestionar el tiempo",
      "Adaptabilidad",
      "Flexibilidad"
    ]
  },
  "contact": {
    "title": "Contacto",
    "text": "Puedes encontrarme en las siguientes plataformas o escribirme directamente si quieres colaborar."
  },
  "projects": {
    "title": "Proyectos",
    "repo": "Repositorio",
    "demo": "Ver Demo",
    "list": [
      {
        "imageKey": "clickalquiler",
        "title": "ClickAlquiler – Proyecto Final Bootcamp",
        "description": "App web para gestión de alquileres. Incluye login, historial de usuarios, Google Maps y sistema de reservas.",
        "tech": ["React", "Node.js", "Express", "SQL", "CSS"],
        "repo": "https://github.com/AuthorGG/PFB"
      },
      {
        "imageKey": "pomodoit",
        "title": "PomoDoIt!",
        "description": "Temporizador de pomodoro desarrollado en React, con librerías externas y deployed en Vercel. Estilo minimalista y responsivo.",
        "tech": [
          "HTML",
          "JavaScript",
          "CSS",
          "React",
          "Vercel",
          "Tailwind",
          "Framer Motion",
          "React Router"
        ],
        "repo": "https://github.com/AuthorGG/pomodoit",
        "demo": "https://pomo-do-it-psi.vercel.app/"
      },
      {
        "imageKey": "ahorcado",
        "title": "Juego del Ahorcado",
        "description": "Juego clásico del ahorcado desarrollado en React. Estilo minimalista y responsivo.",
        "tech": ["HTML", "JavaScript", "CSS"],
        "repo": "https://github.com/AuthorGG/ahorcado"
      }
    ]
  },
  "footer": {
    "text": "© 2025 Carlos Curiel. Todos los derechos reservados.",
    "madeWith": "Hecho con ❤️ usando React"
  }
}
