{
  "nav": {
    "about": "About",
    "projects": "Projects",
    "education": "Education",
    "skills": "Skills",
    "contact": "Contact"
  },
  "about": {
    "title": "About me",
    "text": " Hi! I'm Carlos 'Tuto' Curiel Ramos. I'm a trained psychologist and humanistic psychotherapist, with several years of experience helping people find meaning, heal emotional wounds, and reconnect with themselves. I'm also a musician, a lover of mellow indie rock chords, well-placed delay pedals, and lyrics that say more than they seem to.\n\nBut as a certain grey wizard once said —who never arrives late nor early, but precisely when he means to— you never truly know yourself until you step into new paths. So, with sword in hand (well, keyboard in hand), I ventured into the world of web development.\n\nThrough an intensive full stack bootcamp, I've trained as a developer working on projects that integrate frontend (React, Tailwind, Framer Motion) and backend (Node.js, Express, SQL), external APIs, and deployment on Vercel. I've built a rental management app with login, user history, and interactive maps; a personalized carbon footprint calculator; and a sleek, animated Pomodoro timer.\n\nI love writing code with intention — with the same sensitivity I bring to composing a song or accompanying someone in therapy. Programming lets me combine logic, design, empathy, and a mindset of continuous improvement. To me every new project is a quest worth pursuing.\n\nI'm excited to keep learning, growing as a developer, and contributing wherever I can add value. If my profile resonates with you —like a good anime opening— I’d be happy to connect."
  },
  "skills": {
    "title": "Skills",
    "knownTitle": "Technologies I Know and Use:",
    "learningTitle": "The Technologies I'm currently Learning:",
    "SoftSkillsTitle": "Soft Skills:",
    "SoftSkillsList": [
      "Communication",
      "Teamwork",
      "Problem-solving",
      "Adaptability",
      "Critical Thinking",
      "Collaboration",
      "Attention to Detail"
    ]
  },
  "education": {
    "title": "Education",
    "item1": {
      "degree": "Full Stack Web Development Bootcamp",
      "institution": "Hack A Boss"
    },
    "item2": {
      "degree": "Bachelor's Degree in Psychology",
      "institution": "Universidad Santa Maria la Antigua (Panamá)"
    }
  },
  "contact": {
    "title": "Contact",
    "text": "You can find me on the following platforms or write me directly if you'd like to collaborate."
  },
  "projects": {
    "title": "Projects",
    "repo": "Repository",
    "demo": "Live Demo",
    "list": [
      {
        "imageKey": "clickalquiler",
        "title": "ClickAlquiler – Proyecto Final Bootcamp",
        "description": "Web app for rental management. Includes login, user history, Google Maps and reservation system. Various features such as creation of users, reservation history and others",
        "tech": ["React", "Node.js", "Express", "SQL", "CSS"],
        "repo": "https://github.com/AuthorGG/PFB"
      },
      {
        "imageKey": "pomodoit",
        "title": "PomoDoIt!",
        "description": "Pomodoro timer built with React, with external libraries and deployed on Vercel. Minimalistic and responsive design.",
        "tech": [
          "HTML",
          "JavaScript",
          "CSS",
          "React",
          "Vercel",
          "Tailwind",
          "Framer Motion",
          "React Router"
        ],
        "repo": "https://github.com/AuthorGG/pomodoit",
        "demo": "https://pomo-do-it-psi.vercel.app/"
      },
      {
        "imageKey": "ahorcado",
        "title": "HangMan Game",
        "description": "Classic game of hangman, made with HTML, CSS and JavaScript. First ever project.",
        "tech": ["HTML", "JavaScript", "CSS"],
        "repo": "https://github.com/AuthorGG/ahorcado"
      }
    ]
  },
  "footer": {
    "text": "© 2025 Carlos Curiel. All rights reserved.",
    "madeWith": "Made with ❤️ using React"
  }
}
